app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "El sueno de los heroes"], ["body", "Andres, es un hp que come michisima mierda"], ["created_at", "2024-04-08 21:08:44.140731"], ["updated_at", "2024-04-08 21:08:44.140731"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "playaso"], ["body", "antonio mierda"], ["updated_at", "2024-04-08 21:24:33.609293"], ["id", 2]]
---
    def update
      @article = Article.find(params[:id])

      if @article.update(article_params)